# Leetcode - Introduction to pandas
This notebook contains the basic of pandas module which is an essential tool in datascience field.
It covers below topics - 
- Pandas Data Structures
- Data Inspection
- Data Selecting
- Data Cleaning
- Table Reshaping
- Method Chaining

Leetcode - https://leetcode.com/studyplan/introduction-to-pandas/

### Import module

In [2]:
import pandas as pd

## Pandas Datastructure

### Create Dataframe

In [5]:
student_data = [['john',33],['romeo',23]]

df = pd.DataFrame(student_data,columns=['name','age'])
df

    name  age
0   john   33
1  romeo   23

## Data Inspection

### Dataframe size

In [6]:
df.shape # shows rows and columns

(2, 2)

### show top rows

In [13]:
df.head(1) # default is 5 rows

   name  age  age_double
0  john   33          66

## Data selection

### Select data

In [7]:
df[df['name']=='john'][['name','age']]

   name  age
0  john   33

In [9]:
df.loc[df['age']==23, ['name']]

    name
1  romeo

### create new column

In [11]:
df['age_double'] = df['age'] * 2
df

    name  age  age_double
0   john   33          66
1  romeo   23          46

## Data Cleaning

### Drop duplicates
- Drop the duplicate data based on email column and keep only first occurance.
- Parameters
    - subset - list of columns for identifying duplicate rows
    - keep - it tells which row we need to keep
        - 'first': (default) Drop duplicates except for the first occurrence.
        - 'last': Drop duplicates except for the last occurrence.
        - False: Drop all duplicates.
    - inplace: If set to True, the changes are made directly to the object without returning a new object. If set to False (default), a new object with duplicates dropped will be returned.

In [17]:
student_data = [['john',33,'am@gmail.com'],['romeo',23,'bm@gmail.com'],['juliet',22,'bm@gmail.com']]

df = pd.DataFrame(student_data,columns=['name','age','email'])
display(df)

df = df.drop_duplicates(subset=['email'],keep='first')  
df

     name  age         email
0    john   33  am@gmail.com
1   romeo   23  bm@gmail.com
2  juliet   22  bm@gmail.com

    name  age         email
0   john   33  am@gmail.com
1  romeo   23  bm@gmail.com

### Drop missing data
- Drop the rows which has (None or NaN)
- Syntax
    - DataFrame.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)
- Parameters
    - axis: It can be {0 or 'index', 1 or 'columns'}. By default it's 0. If axis=0, it drops rows which contain missing values, and if axis=1, it drops columns which contain missing value.
    - how: Determines if row or column is removed from DataFrame, when we have at least one NA or all NA.
        - how='any' : If any NA values are present, drop that row or column (default).
        - how='all' : If all values are NA, drop that row or column.
    - thresh: Require that many non-NA values. This is an integer argument which requires a minimum number of non-NA values to keep the row/column.
    - subset: Labels along the other axis to consider, e.g. if you are dropping rows these would be a list of columns to include. This is particularly useful when you only want to consider NA values in certain columns.
    - inplace: It's a boolean which makes the changes in data frame itself if True. Always remember when using the inplace=True argument, you're modifying the original DataFrame. If you need to retain the original data for any reason, avoid using inplace=True and instead assign the result to a new DataFrame.

In [23]:
student_data = [['john',33,'am@gmail.com'],['romeo',23,'bm@gmail.com'],['juliet',22,None]]

df = pd.DataFrame(student_data,columns=['name','age','email'])
display(df)

df.dropna(subset=['email'], inplace=True)
df

     name  age         email
0    john   33  am@gmail.com
1   romeo   23  bm@gmail.com
2  juliet   22          None

    name  age         email
0   john   33  am@gmail.com
1  romeo   23  bm@gmail.com

### Modify columns
- This updates the values in an existing column of the DataFrame. If the column didn't exist for some reason, pandas would create it.

In [27]:
display(df)

df['age'] =df['age'] *2
df

    name  age         email
0   john   66  am@gmail.com
1  romeo   46  bm@gmail.com

    name  age         email
0   john  132  am@gmail.com
1  romeo   92  bm@gmail.com

### Rename column
- The rename function in pandas is a very useful tool when it comes to renaming column names or index names.
- DataFrame.rename(mapper=None, index=None, columns=None, axis=None, copy=True, inplace=False, level=None, errors='raise')
- Parameters
    - mapper, index, columns: The dictionaries you can pass to rename index or columns. In our example, we use columns.
    - axis: Can be either "index" or "columns". Determines whether you're renaming the index or the columns. By default, if you provide the columns argument, you're renaming columns.
    - copy: If set to True, a new DataFrame is created. If False, the original DataFrame is modified.
    - inplace: If set to True, the renaming will modify the DataFrame in place and nothing will be returned. If False, a new DataFrame with renamed columns will be returned without modifying the original DataFrame.
    - level: For DataFrames with multi-level index, level from which the labels should be renamed.
    - errors: If 'raise', an error is raised if you try to rename an item that doesn't exist. If set to 'ignore', any failure to rename items will be ignored.

In [30]:
display(df)

df.rename(columns = {'name':'student_name','age':'age_years'},inplace=True)
df

    name  age_in_years         email
0   john           132  am@gmail.com
1  romeo            92  bm@gmail.com

  student_name  age_in_years         email
0         john           132  am@gmail.com
1        romeo            92  bm@gmail.com

### Change Datatype
- The astype function is used to cast a pandas object to a specified dtype (data type). astype can be used to cast a pandas object to any dtype. The astype function does not modify the original DataFrame in place. Instead, it returns a new DataFrame with the specified data type changes. If you want to reflect changes in the original DataFrame, you need to reassign the result back to it or use the copy parameter accordingly.
- Syntax
    - DataFrame.astype(dtype, copy=True, errors='raise')
- Parameters
    - dtype: It's a data type, or dict of column name -> data type.
    - copy: By default, astype always returns a newly allocated object. If copy is set to False, a new object will only be created if the old object cannot be casted to the required type.
    - errors: Controls the raising of exceptions on invalid data for the provided dtype. By default, raise is set which means exceptions will be raised.

In [33]:
print(df.dtypes)

df = df.astype({'age_in_years':object})
print('-'*10)
print(df.dtypes)

student_name    object
age_in_years    object
email           object
dtype: object
----------
student_name    object
age_in_years    object
email           object
dtype: object

### Fill missing data
- fillna is a function in the pandas library, used primarily with pandas Series and DataFrame objects. It allows you to fill NA/NaN values using specified methods. In this context, we are using it to replace the None (or NaN in the usual dataframe representation) values.
- parameters
    - value: Scalar, dict, Series, or DataFrame. The value to use to fill holes (e.g. 0). This is what we use in our solution.
    - method: {‘backfill’, ‘bfill’, ‘pad’, ‘ffill’, None}. Method to use for filling holes in reindexed Series. Default is None.
    - axis: {0 or ‘index’, 1 or ‘columns’}. Axis along which to fill missing values.
    - inplace: Bool. If True, fills in place. Note: this will modify any other views on this object. Default is False.

In [35]:
df = pd.DataFrame({'name':[None,'ram','amit'],'age':[21,None,None]})
display(df)

# fill values for a single coulmn
df['name'].fillna('temp',inplace = True)
display(df)

df = pd.DataFrame({'name':[None,'ram','amit'],'age':[21,None,None]})

# fill values for all columns
df.fillna('temp',inplace = True)
display(df)

   name   age
0  None  21.0
1   ram   NaN
2  amit   NaN

   name   age
0  temp  21.0
1   ram   NaN
2  amit   NaN

C:\Users\Mukesh\AppData\Local\Temp\ipykernel_2844\3530452573.py:11: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'temp' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df.fillna('temp',inplace = True)

   name   age
0  temp  21.0
1   ram  temp
2  amit  temp

## Table Reshaping

### Concatenate data
- pd.concat(): A convenient function within pandas used to concatenate DataFrames either vertically (by rows) or horizontally (by columns).
    - The objs parameter is a sequence or mapping of Series or DataFrame objects to be concatenated.
    - The axis parameter determines the direction of concatenation:
        - axis=0 is set as the default value, which means it will concatenate DataFrames vertically (by rows).
        - axis=1 will concatenate DataFrames horizontally (by columns).

In [39]:
df1 = pd.DataFrame({'name':['kamna','ram','amit'],'age':[21,22,23]})
display(df1)

df2 = pd.DataFrame({'name':['ajith','ramya','anita'],'age':[20,12,25]})
display(df2)

print('Joining vertically')
df_concat = pd.concat([df1,df2],axis=0)
display(df_concat)

print('Joining horizontally')
df_concat = pd.concat([df1,df2],axis=1)
display(df_concat)

    name  age
0  kamna   21
1    ram   22
2   amit   23

    name  age
0  ajith   20
1  ramya   12
2  anita   25

Joining vertically

    name  age
0  kamna   21
1    ram   22
2   amit   23
0  ajith   20
1  ramya   12
2  anita   25

Joining horizontally

    name  age   name  age
0  kamna   21  ajith   20
1    ram   22  ramya   12
2   amit   23  anita   25

### Pivot
- The pivot function in pandas is used to reshape data based on column values and get a new DataFrame out of it. pivot takes the following arguments which we will utilize:
    - index: Determines the rows in the new DataFrame.
    - columns: Determines the columns in the new DataFrame.
    - values: Specifies the values to be used when the table is reshaped.
![](https://leetcode.com/problems/reshape-data-pivot/Figures/3316/3316-1.png)

In [43]:
data = {'city' : ['Jacksonville','Jacksonville','Jacksonville','Jacksonville','Jacksonville','ElPaso','ElPaso','ElPaso','ElPaso','ElPaso'],
        'month' : ['January', 'February', 'March', 'April', 'May', 'January', 'February', 'March', 'April', 'May'],
        'temperature' : [13, 23, 38, 5, 34, 20, 6, 26, 2, 43]}

df = pd.DataFrame(data)
display(df)


print('Reshaped pivot data')
df = df.pivot(index = 'month', columns = 'city', values = 'temperature')
df

           city     month  temperature
0  Jacksonville   January           13
1  Jacksonville  February           23
2  Jacksonville     March           38
3  Jacksonville     April            5
4  Jacksonville       May           34
5        ElPaso   January           20
6        ElPaso  February            6
7        ElPaso     March           26
8        ElPaso     April            2
9        ElPaso       May           43

Reshaped pivot data

city      ElPaso  Jacksonville
month
April          2             5
February       6            23
January       20            13
March         26            38
May           43            34

In [44]:
# reorder the index
df = df.reindex(["January", "February", "March", "April", "May", "June", "July", "August", "September", "October", "November", "December"])
df

city       ElPaso  Jacksonville
month
January      20.0          13.0
February      6.0          23.0
March        26.0          38.0
April         2.0           5.0
May          43.0          34.0
June          NaN           NaN
July          NaN           NaN
August        NaN           NaN
September     NaN           NaN
October       NaN           NaN
November      NaN           NaN
December      NaN           NaN

### Melt
- melt function is used to transform or reshape data. It changes the DataFrame from a wide format, where columns represent multiple variables, to a long format, where each row represents a unique variable.
- Parameters
    - id_vars: This specifies the columns that should remain unchanged.
    - value_vars: This specifies the columns that we want to "melt" or reshape into rows.
    - var_name: This is the name of the new column that will store the header names from the value_vars.
    - value_name: This is the name of the new column that will store the values from the value_vars.
 
![](https://leetcode.com/problems/reshape-data-melt/Figures/3317/3317-1.png)

In [52]:
data = {'product':['Umbrella','SleepingBag'],
        'quarter_1':[400,500],
        'quarter_2':[600,800],
        'quarter_3':[700,200],
        'quarter_4':[100,500]
       }

df = pd.DataFrame(data)
display(df)

df = df.melt(
        id_vars = ['product'],
        value_vars=["quarter_1", "quarter_2", "quarter_3", "quarter_4"],
        var_name = 'quarter',
        value_name = 'sales'
    )

df

       product  quarter_1  quarter_2  quarter_3  quarter_4
0     Umbrella        400        600        700        100
1  SleepingBag        500        800        200        500

       product    quarter  sales
0     Umbrella  quarter_1    400
1  SleepingBag  quarter_1    500
2     Umbrella  quarter_2    600
3  SleepingBag  quarter_2    800
4     Umbrella  quarter_3    700
5  SleepingBag  quarter_3    200
6     Umbrella  quarter_4    100
7  SleepingBag  quarter_4    500

## Advance technique

### Method Chaining
- In Pandas, method chaining enables us to perform operations on a DataFrame without breaking up each operation into a separate line or creating multiple temporary variables.
- Performing multiple operations on a DataFrame in a single line by connecting methods with dots. This is a powerful feature in pandas, which can make code concise but might be complex to read for newcomers.

![](https://leetcode.com/problems/method-chaining/Figures/3307/3307-1.png)

In [53]:
data = {'name':['ram','shyam','anita'],
        'weight':[23,12,56],
        'age':[21,45,22]}

df = pd.DataFrame(data)
display(df)

df = df[df['weight']>20].sort_values(by='weight',ascending=False)[['name']]
df

    name  weight  age
0    ram      23   21
1  shyam      12   45
2  anita      56   22

    name
2  anita
0    ram